# ตัวดำเนินการเปรียบเทียบ

# นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียบกัน
# ต้องเป็นชนิดข้อมูลชนิดเดียวกัน
# คำตอบจะมีเพียงแค่ 2 คำตอบ => True / False

x,y,z = 8,7,9 

#print("ค่า x มากกว่าค่า y หรือไม่ ? : ", x>y)
#print("ค่า x น้อยกว่าค่า y หรือไม่ ? : ", x<y)
#print("ค่า x เท่ากับค่า y หรือไม่ ? : ", x==y)
#print("ค่า x ไม่เท่ากันกับค่า y หรือไม่ ? : ", x!=y)

#print("ค่า x มากกว่า หรือ เท่ากับ ค่า y หรือไม่ ? : ", x>=y)
#print("ค่า x น้อยกว่า หรือ เท่ากับ ค่า y หรือไม่ ? : ", x<=y)

# และ/and
print("ค่า x มากกว่าค่า y และ y มากกว่่า z หรือไม่ ? : ", x>y>z) # ผลที่ออกมาต้อง True ทังคู่ผลถึงจะออกมากเป็น True
print("ค่า x น้อยกว่าค่า y และ y น้อยกว่่า z หรือไม่ ? : ", x<y<z)

